viscoelastic/viscoelasticFluidFoam/lidDrivenCavity/VLDCM1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0.01;
        smoother        DIC;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {

        solver           BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

    tauM1
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

    tauM2
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

    tauM3
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

    tauM4
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }
    tauM5
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }
    tauM6
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

}

PISO
{
    nCorrectors    2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    p                   0.3;

    U                   0.5;

    tauM1           0.3;
    tauM2           0.3;
    tauM3           0.3;
    tauM4           0.3;
    tauM5           0.3;
    tauM6           0.3;
}

// ************************************************************************* //
